hugo/public/lunescript/match/index.html
<!DOCTYPE html>
<html lang="ja-jp">
<head><meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no">
<title>06. match 編 - 公開技術情報</title>
<meta name="generator" content="Hugo 0.111.3">
<link href="https://ifritjp.github.io/documentsindex.xml" rel="alternate" type="application/rss+xml">
<link rel="canonical" href="https://ifritjp.github.io/documents/lunescript/match/">
<link rel="stylesheet" href="https://ifritjp.github.io/documents/css/theme.min.css">
<link rel="stylesheet" href="https://ifritjp.github.io/documents/css/chroma.min.css">
<link rel="stylesheet" href="https://ifritjp.github.io/documents/css/custom.css">
<link rel="stylesheet" href="https://ifritjp.github.io/documents/css/highlight_lns.css">
<meta property="og:title" content="06. match 編" />
<meta property="og:description" content="LuneScript は、代数的データ型とパターンマッチをサポートします。 代数的データ型 (alge型) enum 型は、 int, real, str のいずれかの値をグルーピングして、値域を制限" />
<meta property="og:type" content="article" />
<meta property="og:url" content="https://ifritjp.github.io/documents/lunescript/match/" /><meta property="article:section" content="LuneScript" />

<meta property="og:site_name" content="公開技術情報" />
<meta name="twitter:card" content="summary"/>
<meta name="twitter:title" content="06. match 編"/>
<meta name="twitter:description" content="LuneScript は、代数的データ型とパターンマッチをサポートします。 代数的データ型 (alge型) enum 型は、 int, real, str のいずれかの値をグルーピングして、値域を制限"/>
<meta itemprop="name" content="06. match 編">
<meta itemprop="description" content="LuneScript は、代数的データ型とパターンマッチをサポートします。 代数的データ型 (alge型) enum 型は、 int, real, str のいずれかの値をグルーピングして、値域を制限">

<meta itemprop="wordCount" content="1806">
<meta itemprop="keywords" content="" />
</head>
<body><div class="container"><header>
<h1>公開技術情報</h1>


[<a href="https://ifritjp.github.io/documents/en/">English</a>]

[<a href="https://ifritjp.github.io/documents/">Japanese</a>]

</header>
<div class="global-menu">
<nav>
<ul>
<li><a href="/documents/">Home</a></li>
<li><a href="https://ifritjp.github.io/blog2/public/">blog</a></li>
<li><a href="https://ifritjp.github.io/LuneScript-webFront/lnsc_web_frontend/for_wasm/">LuneScript on Web</a></li></ul>
</nav>
</div>
<div class="content-container">
<main><h1>06. match 編</h1>

<p>
LuneScript は、代数的データ型とパターンマッチをサポートします。</p>
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
代数的データ型 (alge型)
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>
enum 型は、 int, real, str のいずれかの値をグルーピングして、値域を制限できます。</p>
<p>
一方、代数的データ型は enum 型をより一般的にしたもので、
int, real, str に限らず全ての型をグルーピングすることが出来ます。</p>
<p>
代数的データ型は alge キーワードで宣言します。</p>
<p>
次に例を示します。</p>
<div class="src src-lns">
<pre tabindex="0"><code class="language-lns" data-lang="lns">// @lnsFront: ok
class Hoge {
   pri let val:int {pub};
}
alge Test {
   Val1,
   Val2( int ),
   Val3( str ),
   Val4( Hoge ),
   Val5( num:int, txt:str ),
}</code></pre>
</div>
<p>
この例では、 alge 型 Test を宣言しています。</p>
<p>
Test は、 Val1 〜 Val5 までの値域を持ちます。
また、 Val1 〜 Val5 はそれぞれ次のパラメータを持ちます。</p>
<table>
<thead>
<tr>
<th>値</th>
<th>パラメータ</th>
</tr>
</thead>
<tbody>
<tr>
<td>Val1</td>
<td>なし</td>
</tr>
<tr>
<td>Val2</td>
<td>int</td>
</tr>
<tr>
<td>Val3</td>
<td>str</td>
</tr>
<tr>
<td>Val4</td>
<td>Hoge</td>
</tr>
<tr>
<td>Val5</td>
<td>int, str</td>
</tr>
</tbody>
</table>
<p>
パラメータの型に制限はありません。
この例の場合、 Val4 は Hoge クラス型をパラメータに持ちます。</p>
<p>
パラメータの個数も制限はありません。
この例の場合、 Val5 は int と str をパラメータに持ちます。</p>
<p>
パラメータには、型だけ指定する方法と、名前と型を指定する方法があります。
この例の場合、 Val2 から Val4 は型だけ指定し、 Val5 はパラメータ名と型を指定しています。
パラメータ名は、そのパラメータの意味を明瞭にする効果があるだけです。</p>
<p>
この alge 型の値を使用する場合、次のように書きます。</p>
<div class="src src-lns">
<pre tabindex="0"><code class="language-lns" data-lang="lns">// @lnsFront: skip
let val1 = Test.Val1;
let val2 = Test.Val2( 1 );
let val3 = Test.Val3( &#34;abc&#34; );
let val4 = Test.Val4( new Hoge( 100 ) );
let val5 = Test.Val5( 10, &#34;xyz&#34; );</code></pre>
</div>
<p>
それぞれの意味は次になります。</p>
<ul>
<li>val1 は Test.Val1</li>
<li>val2 は 1 をパラメータに持つ Test.Val2</li>
<li>val3 は &#34;abc&#34; をパラメータに持つ Test.Val3 </li>
<li>val4 は new Hoge( 100 ) をパラメータに持つ Test.Val4</li>
<li>val5 は 10, &#34;xyz&#34; をパラメータに持つ Test.Val5</li>
</ul>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
match
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p>
enum 型は、次のように元の値と同じように使用できます。</p>
<div class="src src-lns">
<pre tabindex="0"><code class="language-lns" data-lang="lns">// @lnsFront: ok
enum TestEnum {
  val0,
  val1,
  val2,
}
fn func( val:TestEnum ): int {
   return val + 100;
}
let val = 1;
func( unwrap TestEnum._from( val ) );</code></pre>
</div>
<p>
この例では、 関数 <code class="verbatim">func()</code> 内で TestEnum 型の値 + 100 をしていますが、
これは TestEnum 型が int の数値としても利用できることを示しています。</p>
<p>
一方で alge 型の値は、特別な処理が必要です。
その処理が match です。</p>
<p>
次に match の例を示します。</p>
<div class="src src-lns">
<pre tabindex="0"><code class="language-lns" data-lang="lns">// @lnsFront: ok
class Hoge {
   pri let val:int {pub};
}

alge Test {
   Val1,
   Val2( int ),
   Val3( str ),
   Val4( Hoge ),
   Val5( int, str ),
}

fn func( test:Test ) {
   match test {
      case .Val1 {
         print( test.$_txt );
      }
      case .Val2( x ) {
         print( test.$_txt, x );
      }
      case .Val3( x ) {
         print( test.$_txt, x );
      }
      case .Val4( x ) {
         print( test.$_txt, x.$val );
      }
      case .Val5( x, y ) {
         print( test.$_txt, x, y );
      }
   }
}

func( Test.Val1 ); // Test.Val1
func( Test.Val2( 1 ) ); // Test.Val2 1
func( Test.Val3( &#34;abc&#34; ) ); // Test.Val3 abc
func( Test.Val4( new Hoge( 100 ) ) ); // Test.Val4  100
func( Test.Val5( 10, &#34;xyz&#34; ) ); // Test.Val5 10 xyz</code></pre>
</div>
<p>
この例では、 <code class="verbatim">func()</code> 関数内で match を実行しています。</p>
<p>
case によって Val1 〜 Val5 を分岐しています。
また Val2 〜 Val5 は、それぞれパラメータを受け取る変数を宣言しています。</p>
<p>
例えば <code class="verbatim">func( Test.Val2( 1 ) )</code> は、 <code>Test.Val2( 1 )</code> を <code class="verbatim">func()</code> に渡しています。
ここで <code class="verbatim">func()</code> 内の match の <code>case .Val2( x )</code> にマッチします。
そして、 x には 1 がセットされ、 <code>print( test.$_txt, x )</code> が実行されます。</p>
<p>
ここで <code>test.$_txt</code> は、 値域の Val2 を示す &#34;Test.Val2&#34; の文字列が展開されます。</p>
<p>
match は、 switch と同様に default と _default、そして _match を利用できます。</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
alge 型の省略表記
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p>
alge 型も enum 型と同じように省略表記を利用できます。</p>
<p>
次のような alge 型の Test と、その Test を引数に持つ関数があった場合、</p>
<div class="src src-lns">
<pre tabindex="0"><code class="language-lns" data-lang="lns">// @lnsFront: ok
alge Test {
   Val1,
   Val2,
   Val3( int ),
}
fn func( test:Test ) {
   print( test );
}</code></pre>
</div>
<p>
<code class="verbatim">func()</code> をコールする際、次のように Test を省略可能です。</p>
<div class="src src-lns">
<pre tabindex="0"><code class="language-lns" data-lang="lns">// @lnsFront: skip
func( .Val1 );
func( .Val2 );
func( .Val3( 10 ) );</code></pre>
</div>
<p>
なお、 外部モジュールで定義されている alge 型を省略指定する場合、
その外部モジュールを import している必要があります。</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
alge型 の比較
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p>
パラメータを持たない単純な alge 型の値は、次のように比較することが出来ます。</p>
<div class="src src-lns">
<pre tabindex="0"><code class="language-lns" data-lang="lns">// @lnsFront: error
alge Test {
   Val1,
   Val2,
   Val3( int ),
}
fn func( test:Test ) {
   if test == .Val1 {
      print( &#34;Val1&#34; );
   }
   elseif test == .Val2 {
      print( &#34;Val2&#34; );
   }
   elseif test == .Val3(1) {  // error
      print( &#34;Val3&#34; );
   }
   else {
      print( &#34;no&#34; );
   }
}
func( .Val1 ); // Val1
func( .Val2 ); // Val2</code></pre>
</div>
<p>
なお、パラメータを持つ値 (上記の場合 Val3) は、
同じパラメータを与えても異なる値になるため注意が必要です。
ちなみに、上記の <code>test == .Val3(1)</code> はエラーとなります。
なぜならば、この式の結果は必ず「false」となるため、
コンパイルエラーとすることで、実行時に意図しない結果になることを防ぎます。</p>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
alge の使用例
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p>
alge を使うと JSON 構造を次のように書くことが出来ます。</p>
<div class="src src-lns">
<pre tabindex="0"><code class="language-lns" data-lang="lns">// @lnsFront: ok
alge JsonVal {
   JNull,
   JBool(bool),
   JInt(int),
   JReal(real),
   JStr(str),
   JArray(List&lt;JsonVal&gt;),
   JObj(Map&lt;str,JsonVal&gt;),
}
fn dumpJson( stream:oStream, jval:JsonVal ) {
   match jval {
      case .JNull {
         stream.write( &#34;null&#34; );
      }
      case .JBool( val ) {
         stream.write( &#34;%s&#34; (val) );
      }     
      case .JInt( val ) {
         stream.write( &#34;%d&#34; (val ) );
      }        
      case .JReal( val ) {
         stream.write( &#34;%g&#34; (val ) );
      }        
      case .JStr( val ) {
         stream.write( &#39;&#34;%s&#34;&#39; (val ) );
      }        
      case .JArray( list ) {
         stream.write( &#34;[&#34; );
         foreach val, index in list {
            if index &gt; 1 {
               stream.write( &#34;,&#34; );
            }
            dumpJson( stream, val );
         }
         stream.write( &#34;]&#34; );
      }        
      case .JObj( map ) {
         stream.write( &#34;{&#34; );
         let mut cont = false;
         foreach val, key in map {
            if cont {
               stream.write( &#39;,&#39; );
            }
            else {
               cont = true;
            }
            stream.write( &#39;&#34;%s&#34;:&#39; (key) );
            dumpJson( stream, val );
         }
         stream.write( &#34;}&#34; );
      }
   }
}
dumpJson( io.stdout,
          JsonVal.JObj( { &#34;foo&#34;: JsonVal.JInt( 1 ),
                          &#34;bar&#34;: JsonVal.JStr( &#34;abc&#34; ) } ) );</code></pre>
</div>
<p>
alge を使用せずにキャストや継承などを利用すれば同じことは出来ます。
しかし、キャストはもちろん、継承にも欠点があります。</p>
<p>
alge も万能ではありませんが、
幾つかの場面ではキャストや継承を使用するよりも、
より良い選択肢になると思います。</p>
<p>
次回はインタフェースを説明します。</p>
</div>
</div>
<div class="edit-meta">

<br></div><nav class="pagination"><a class="nav nav-prev-2" href="https://ifritjp.github.io/documents/lunescript/enum/" title="05. enum 編"><i class="fas fa-arrow-left" aria-hidden="true"></i> Prev - 05. enum 編</a>
<a class="nav nav-next-2" href="https://ifritjp.github.io/documents/lunescript/variable/" title="07. 変数 編">Next - 07. 変数 編 <i class="fas fa-arrow-right" aria-hidden="true"></i></a>
</nav><footer><p class="powered">Powered by <a href="https://gohugo.io">Hugo</a>. Theme by <a href="https://themes.gohugo.io/hugo-theme-techdoc/">TechDoc</a>. Designed by <a href="https://github.com/thingsym/hugo-theme-techdoc">Thingsym</a>.</p>
</footer>
</main><div class="sidebar">

<nav class="slide-menu">
<ul>
<li class=""><a href="https://ifritjp.github.io/documents">Home</a></li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/lctags/">C/C&#43;&#43; ソースコードタグシステム lctags の紹介<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/lctags/introduce/">C/C&#43;&#43; ソースコードタグシステム lctags の紹介</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/rename/">C/C&#43;&#43; ソースコードをリファクタリング by lctags on emacs (リネーム編)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/enum/">C/C&#43;&#43; の enum 補完 by lctags on emacs</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/highlight/">C/C&#43;&#43; の特定シンボルをハイライト by lctags on emacs</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/varsize/">C/C&#43;&#43; の変数サイズ確認 by lctags on emacs</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/callgraph/">C言語/C&#43;&#43; コードを解析してインタラクティブなコールグラフ表示 by lctags</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/modulegraph/">C言語/C&#43;&#43; コードを解析してインタラクティブなモジュール構成図っぽいグラフ表示 by lctags</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/callfunc/">lctags で C 言語の関数コールを簡単に</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/register/">lctags のプロジェクト簡易登録</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/c-language/">lctags を開発している時に改めて感じた C 言語規格のイケてないところ</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/subroutine/">lctags を使って C/C&#43;&#43; ソースコードをリファクタリング(サブルーチン化編)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/windows/">Windows で lctags (C言語/C&#43;&#43; のタグジャンプ、コールグラフ、etc..)</a></li>
</ul>
  
</li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/lua/">C/C&#43;&#43; 言語プログラマのための Lua 入門リファレンス<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/lua/detail/">C インタフェース詳細編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lua/interface/">C インタフェース編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lua/fengari/">fengari の使い方 (Lua を Web ブラウザで動かす方法)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lua/lua5.4/">Lua 5.4 の主な変更点</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lua/anti-pattern/">Lua でやりがちなミス</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lua/pointer/">ポインタ編</a></li>
</ul>
  
</li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/emacs/">Emacs<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/emacs/simple-httpd/">emacs 簡易 HTTPD 化パケージ simple-httpd.el</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/emacs/company-mode/">自作言語 (LuneScript) の emacs company-mode backend 設定</a></li>
</ul>
  
</li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/go/">Goes<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/go/package/">Go のパッケージ</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/go/guide/">Go 入門</a></li>
</ul>
  
</li>

<li class=""><a href="https://ifritjp.github.io/documents/gcp/">Google Cloud Platform を使ってみる</a>
  
</li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/javascript/">Javascripts<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/javascript/d3force/">D3.js V4 forceSimulation のノード動的更新(追加・削除)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/javascript/thread/">JavaScript のスレッド(非同期処理)</a></li>
</ul>
  
</li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/libclang/">Lua で C/C&#43;&#43; の構文解析 (libclang の Lua binding)<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/libclang/operator/">libclang で演算子を特定する方法</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/libclang/ast/">libclang の AST(Abstract Syntax Tree)</a></li>
</ul>
  
</li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/rust/">Rusts<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/rust/lifetime/">C/C&#43;&#43;エンジニアのための Rust のデータ所有権とライフタイム入門</a></li>
</ul>
  
</li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/singleboard/">Singleboards<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/singleboard/raspios64-point/">64bit 版 Raspberry Pi OS でカーネルモジュールを使った際に遭遇したエラーと対応方法</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/singleboard/build-kernel-module-64/">64bit 版 Raspberry Pi OS のカーネルモジュールのビルド環境設定</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/singleboard/bluetooth-a2dp-receiver/">Raspberry Pi で Bluetooth レシーバー (オーディオ:A2DP) を作成するための設定方法解説</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/singleboard/usb-gadget/">USB Gadget 機能を利用して Raspberry Pi を HID Keyboard と RNDIS の複合デバイスにする</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/singleboard/recover-image/">誤ってパーティションテーブル (LBA 0) を消して(0クリアして)しまった場合の対処</a></li>
</ul>
  
</li>

<li class="parent has-sub-menu"><a href="https://ifritjp.github.io/documents/lunescript/">トランスコンパイラ LuneScript で Lua の開発をもっと楽に!!<span class="mark opened">-</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/tutorial1/">00. はじめに</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/tutorial2.setup/">01. 導入編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/tutorial3.hello/">02. Hello world</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/crosscompile/">03. Lua バージョン間のクロスコンパイル</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/value/">04. 値編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/set/">04.2. Set 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/tuple/">04.3 タプル編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/enum/">05. enum 編</a></li>
<li class="active"><a href="https://ifritjp.github.io/documents/lunescript/match/">06. match 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/variable/">07. 変数 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/branch/">08. 一般分岐構文 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/loop/">09. 繰り返し構文 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/func/">10. 関数 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/multipleretval/">10.2. 多値の戻り値</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/defaultarg/">10.3. 引数の省略 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/arg/">10.4. 可変長引数、戻り値 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/closure/">10.5. クロージャ</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/error/">10.6. エラーハンドリング編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/nilable/">11. nilable 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/class1/">12. クラス 基本 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/class2accessor/">13. accessor 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/classinherit/">14. クラス 継承 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/classadvertise/">15. クラス advertise 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/classoverride/">16. クラス override 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/interface/">17. インタフェース 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/classmapping/">18. mapping 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/generics/">19. generics 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/generics-go/">19.2. generics (2つの collection 型) 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/nilcond/">20. nil 条件演算子 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/import/">21. import/provide 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/require/">22. require/module 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/glue/">22.1. glue コードの半自動生成</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/lua/">22.2. Lua と連携 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/make/">23. ビルド 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/macro/">24. マクロ 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/cast/">25. キャスト 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/subfile/">26. subfile 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/lazyloading/">27. 遅延ロード 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/shebang_main/">28. shebang とコマンドライン引数</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/dir/">29. LuneScript を利用するプロジェクトの推奨ディレクトリ構成</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/go/">80. Go 言語へのトランスコンパイル</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/go_package/">80.2 Go 言語へのトランスコンパイル時のパッケージ</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/lua_runtime/">80.3 Go へトランスコンパイルした際の Lua ランタイム</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/go_wasm/">80.4 LuneScript の WebAssembly 対応</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/async/">81. 安全な非同期処理</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/async_old/">81.1 非同期処理(過去情報)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/luago/">82. Lua と連携 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/ebnf/">A. BNF</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/lnstags/">A. lnstags によるタグジャンプ (ソースコードタグシステム)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/reason/">A. Lua のトランスコンパイラ LuneScript を開発した理由</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/regret/">A. LuneScript の言語仕様でミスだったと思っているところ</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/onweb/">A. Web ブラウザ上で動作する LuneScript</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/recommend/">A. トランスコンパイラ開発のすゝめ</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/completion/">A.イマドキな開発環境でもっと楽しよう</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/box/">Box 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/test/">X. 言語開発の品質コントロールにおけるセルフホスティングの重要性とテスト設計</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/design/">Y.1 LuneScript の開発方法</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/design-2/">Y.2 LuneScript の開発(型情報管理)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/design-3/">Y.3 LuneScript の開発(スコープとシンボル)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/go_study/">Z. Go 言語へのトランスコンパイル (検討段階)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/all/">全文検索用結合ファイル</a></li>
</ul>
  
</li>
</ul>
</nav>



<div class="sidebar-footer"></div>
</div>
</div><a href="#" id="backtothetop-fixed" class="backtothetop"
 data-backtothetop-duration="600"
 data-backtothetop-easing="easeOutQuart"
 data-backtothetop-fixed-fadeIn="1000"
 data-backtothetop-fixed-fadeOut="1000"
 data-backtothetop-fixed-bottom="10"
 data-backtothetop-fixed-right="20">
<span class="fa-layers fa-fw">
<i class="fas fa-circle"></i>
<i class="fas fa-arrow-circle-up"></i>
</span></a>
</div>
</body>
</html>
